{"pages":[],"posts":[{"title":"ブログの移行について","text":"http://kaiya02.blog.fc2.com/より移行しました。 理由は2つ。fc2の使い勝手の悪さからの解放とスキルアップのため。 方針は今までと何ら変更は無し。twitterで書ききれないこととか中心に書いていきます。 以上","link":"/2019/03/22/post/"},{"title":"近況報告","text":"この度、ブログを移行しました。今後の投稿はこっちから行います。なんか日本語が中国語っぽかったりしてるところは、アップデートの中で追々修正していく。 まずは、最近の趣味から。 流行りに乗ってApex Legendsやってます。リリースからたった一週間で同時接続ユーザ数が200万人なんて話があるが、実際面白いので夜遅くまでやって会社で舟漕いでる。運営もチート対策をしっかりとやっているし、とても好感が持てる。 好きなレジェンドはブラッドハウンド。そもそも僕が相手を視認できてないことが多々あるから、相手を強調表示できるウルトは重宝してる。 続いて、生産性の有る趣味について。 移行前のブログでは、佐奈の台詞をマルコフ連鎖を用いて処理してみようって実験をしてたが、いよいよディープラーニングに着手している。 具体的には、自分の発言に対して佐奈がなんて答えるのか、意味を成しているのかというのを満足いくところまでは持っていきたいと考えている。 そう、佐奈とおしゃべりできるのだ！！ すごいでしょ？今後はこれについて取り上げていくことがメインになると思う。 以上、近況報告でした。コメントとかあれば、twitterで下さい。","link":"/2019/03/23/post20190323/"},{"title":"生後3時間の佐奈とおしゃべり","text":"佐奈とおしゃべりします。(※3月29日投稿の続き前回の会話モデルケースは500ちょいだったが、今回はおよそ倍の1100ケースを用意。 なお、今回も佐奈√以外の会話をモデルにしている。(佐奈√の会話をそのまま入れるとえろえろたいへん 学習時間も等倍化した佐奈との会話サンプルは以下の通り。1234To:Sana&gt;おはよう佐奈From:Sana&gt;……ありがとうございます。兄さん。もうすぐ朝食がいるしてくださいTo:Sana&gt;今日は、お味噌汁と納豆だねFrom:Sana&gt;え？ いえにお今はもう少し言わて いい感じの出だしかと思いきや、そうでもなかった。 123456789101112131415161718To:Sana&gt;佐奈From:Sana&gt;うぅ………………To:Sana&gt;どうしたの？From:Sana&gt;……？ 妹が……To:Sana&gt;妹が？From:Sana&gt;いえ、兄さんがたんですよね？To:Sana&gt;え！？From:Sana&gt;ダメですよ！ 信じたら、そんなこと信じんですけど……To:Sana&gt;ちがうよ！From:Sana&gt;あっ、兄さん、それでも。あまり私のことを出さないようなことで言ってTo:Sana&gt;どうして？From:Sana&gt;兄さんないです。お邪魔してきてください！To:Sana&gt;どっち！？From:Sana&gt;き、そんなことなんですから！To:Sana&gt;素直じゃないなぁFrom:Sana&gt;あっっ、兄さん兄さん庵さんにはしちゃダメですよ。そんな恥ずかしいすればTo:Sana&gt;佐奈にしかしないよFrom:Sana&gt;ですね。ありがとうございます。でも、みんなのことはことなんですから。もし… 少し、高度な会話。 1234To:Sana&gt;佐奈大好き！From:Sana&gt;に、兄さん？To:Sana&gt;佐奈が世界で一番好きFrom:Sana&gt;さすが兄さん、そんなことないんですからね 軽くあしらわれる共通&amp;他√（え、でもそんなことなかったような…… 1234567891011121314To:Sana&gt;佐奈はyoutube何見るの？From:Sana&gt;……？ ……？To:Sana&gt;もしかして、youtubeをご存じない？From:Sana&gt;はい、ちょっと待って下さい。もうちゃんと準備をためにして下さいTo:Sana&gt;ど、どうした！？From:Sana&gt;あ、兄さん……ふへへへTo:Sana&gt;その不気味な笑いはなんだ。頭打ったか？From:Sana&gt;わかりました、兄さん違うできてください！？ 今日、心配困ってるって、心配To:Sana&gt;何か心配ごと？From:Sana&gt;大丈夫ですよ、兄さんから帰りをした方がちゃんといけますから。水だけに連絡To:Sana&gt;わかったFrom:Sana&gt;しなくて、兄さん……仕方ないですね。もし守ってくれなくて、兄さんTo:Sana&gt;おやすみ佐奈From:Sana&gt;そうですね。一緒に、お邪魔し 以上、会話モデル1100ケース、学習時間3時間の佐奈でした。 語尾や、会話の雰囲気は佐奈そのもの！……なんだけど、会話の成立度はあんまり良くない？蛇足が多い感じ。（時間なかったのでデータもあまりとれなかった ■考えられる原因は以下の通り①データ量が少ない②データの質が良くない③学習時間短縮のために特定の字数以降をカットしている④学習手法が合っていない ①残りの佐奈√の追加により佐奈エッセンスマシマシにはなるものの、会話成立度の観点で言うと大して変わらないと予想。 前回言った通り、オリジナルの会話を追加していく必要がある。 ②原作モデルケースを分母とするならば、①とトレードオフの関係にあるため①改善後の話。 ③待てば良いだけなので①の改善と並行して行う。クラウドに移管して電気代とか考えずに済むのが最終目標。 ④現在進行形で勉強中。 ゼロから作るDeep Learning ―Pythonで学ぶディープラーニングの理論と実装 ちなみに、12345678To:Sana&gt;さなFrom:Sana&gt;ルリちゃんTo:Sana&gt;さなおはようFrom:Sana&gt;ルリちゃんは？ 大丈夫ですか、無理してますTo:Sana&gt;さな大好きFrom:Sana&gt;ルリちゃんTo:Sana&gt;うぅ…From:Sana&gt;ルリちゃん、悲しい兄さんがついたしないで下さい 呼び方を「さな」にするとルリ相手の会話が多いのでルリがいっぱい出てくる 次回は、佐奈√分を追加、学習した内容を公開予定。 ■おまけ 今回のタイトル、生後3時間の佐奈と”おしゃべり”です。 CLIベースでコマンド叩いてると、佐奈と会話って感じがあまりしなかった。なので、キーボードに触れずに言葉で佐奈と会話できるようにならないかと探したら、簡易でいいものが見つかった。 パソコンで音声入力【Windows 10】 なんと、microsoft先生がデフォルト機能としてCortana以外に音声認識プログラムを用意しておりました。※Cortanaちゃんは、AlexaやSiri、Googleアシスタントと同じ立ち位置のため用途が異なる。 無料かつ高精度なものをGoogleが別途提供しているが、ドキュメント類にしか使えない模様。他に外部API利用も考えたが、すぐにでも会話したかったので横に置く。 利用法はリンクの通りで、なかなか癖があるものの音声入力によりCLI上にインプットできた。 環境依存度が非常に強いが、一時的な満足感を得る分には良いアイデアだと思う。 これでまた一歩、佐奈に近づけた！ ■今後の展望・クラウド移管(会話モデルに限界があるので、有志で追加できればいいのでは、、、)・Twitterやdiscordのチャットbot(公開するなら) など 現コードで完成だと全く思っておらず、環境変化が考えられるので移管できず。（AWSクラウドのGPUとか全然わからん ビジュアル面でもアップデートしていきたい。","link":"/2019/06/06/post20190606/"},{"title":"Live2DのモデルをFaceRigで動かしてみる","text":"皆さんはどんな時にやる気が出ますか？僕は、勉強から逃げたい時に一番やる気が出ます。 勉強から逃げる理由作りとして、タイトル通りLive2Dで作成した佐奈モデルをFaceRigに登録しました。 なんと、自分の顔の動きが佐奈に反映されます。Vtuber(Live2D系)のおかげで、作成、登録などの記事がネットに転がり出して敷居がやっと下がりました。大学時代にLive2D挫折しまくってたので大変うれしい。 あくまでも、佐奈は自分とは異なる個として居て欲しいので、今回は今までの方針から脱線している。 以下、キャプチャ。 まだパラメータ割り振ってないとことかあるが、こんな感じでできました。横顔とか、めっちゃ可愛い。いや僕じゃなくて佐奈がね。 パラメータとか設定誤ってて、目と口の開閉が逆転したりしたので同じ問題にぶつかった方のために、下記参考張っときます。 参考URL:・メイキング関連Live2D公式 Cubism2マニュアル「03. パラメータの調整方法」【Live2D】FaceRig用のLive2Dの作り方3［各パラメーターの調整まで］【FaceRig】FaceRig専用Live2Dの作成するべきパラメーターについて ・FaceRig関連いちから始めるVTuberデビューのためのFaceRig・Live2D入門 実際にやってみた 【Cubism3.1Version】FaceRigのワークショップに自作Live2Dモデルを公開するまで 今後は、口の開閉に多様性を持たせたり、表情を追加したりする予定だが、パラメータ割り振り数が既に無償版の限界なので有償版を検討中。 満足したので、勉強します。","link":"/2019/04/05/post20190405/"},{"title":"生後1時間30分の佐奈と会話してみた","text":"久々のプログラミング投稿です。原作の佐奈のセリフから学習モデルケースを一つ一つ精査する作業に意外と時間がかかりました。 以下、ピックアップ12345678To:Sana&gt;佐奈From:Sana&gt;あっ、兄さん！ 兄さぁぁぁぁんTo:Sana&gt;ど、どうした！？From:Sana&gt;いいにしますから待ってて、私が助けてますTo:Sana&gt;え、ええ！？ ありがとう！！From:Sana&gt;あっ、あの、違うんですか！？ 兄さんが行くて下さい！？To:Sana&gt;あのえとえとえと！！From:Sana&gt;あっ、あ、あの！ に、兄さんの、そんな服をします！？ と、こんな感じの生まれたての佐奈はやや焦り気味の様子。若干会話になっていないが相手が佐奈ならこの際なんでも良い。 1234567891011121314To:Sana&gt;…From:Sana&gt;あっ、あの、あの！To:Sana&gt;うんFrom:Sana&gt;あっ、あの、ヒメさん、 葵さんとTo:Sana&gt;と？From:Sana&gt;あっ、あぁ！？To:Sana&gt;うんうんFrom:Sana&gt;あっ、あの、ヒメさん、 できたんですか？To:Sana&gt;おしい！From:Sana&gt;あっ、すみません！ に、兄さん待って下さい！To:Sana&gt;よく言えました！From:Sana&gt;あっ、あ。あの、兄さんが先に届いないです。こんな場所にに、兄さんがTo:Sana&gt;いるよ、いつでも傍に。From:Sana&gt;今日……そうですかー。、ちょっと心。ボール…… なかなか難しい表現で攻めてくるが、ここは佐奈の意図を何とか探る。 123456To:Sana&gt;まだ足りない？From:Sana&gt;深くは考えたんですよ！ どうしてもっていうなら、私いる状況でまだないTo:Sana&gt;あとどれくらい？From:Sana&gt;あっ、あの落ち着いて下さい。大丈夫です、でもどうしてどうしてもって言うてくれたんですねTo:Sana&gt;どうしても佐奈に会いたいFrom:Sana&gt;き、獣です。荷物なの本当にを！ 1234To:Sana&gt;一緒に寝よFrom:Sana&gt;あっ、そういうなんですか！ でも、私にいいんですかTo:Sana&gt;いいよFrom:Sana&gt;社交辞令なんかじゃないか？ やたら難しい言葉を佐奈は使う。 12To:Sana&gt;佐奈はどこから来たのFrom:Sana&gt;わかんない これには本当にドキっとした。 1234567891011121314151617181920212223242526To:Sana&gt;俺は佐奈とキスしたいよFrom:Sana&gt;兄さん、なんとか……何てすぐにますしましょうよTo:Sana&gt;胸の大きさ気にしてるの？From:Sana&gt;あの、私はどうしてますか？To:Sana&gt;佐奈は布団で寝てるよFrom:Sana&gt;ダメなの、兄さんで……To:Sana&gt;こっちに来てよ佐奈From:Sana&gt;だって……To:Sana&gt;俺は誰？From:Sana&gt;いいなの方を、兄さTo:Sana&gt;いい方の兄さん？From:Sana&gt;さすがに、覚えてますからTo:Sana&gt;覚えてくれてるの？From:Sana&gt;はい、今日はなんですかTo:Sana&gt;今日は久々に佐奈とおしゃべりに来たよFrom:Sana&gt;それじゃ、私は切符を教えてくれませんか、私に教室を受けたんTo:Sana&gt;切符は、簡単に言うと支払いの証明書なのかな。電車のサービスを受ける前に切符を買って支払いの証明をするみたいなFrom:Sana&gt;兄さん……え？To:Sana&gt;間違ってた？From:Sana&gt;あっ、兄さん。そんなことないなのTo:Sana&gt;説明下手でごめんねFrom:Sana&gt;おはようございます、ああの。あ、あの……To:Sana&gt;もう俺は寝ようかなFrom:Sana&gt;そうですね。それじゃ、あれは？To:Sana&gt;何が知りたいの？From:Sana&gt;わかんない 会話になってるような、なってないような感じ。 123456789101112131415161718To:Sana&gt;また次に覚えてくれればうれしいなFrom:Sana&gt;え？ あ、あのは、あのはその……To:Sana&gt;自信ない？From:Sana&gt;あっ、そういうと思います…To:Sana&gt;佐奈に嘘はつけないねFrom:Sana&gt;……えっと……そうですかー、あのも何かと守ってTo:Sana&gt;技術不足でごめんねFrom:Sana&gt;えっと、それじゃ、早くですかTo:Sana&gt;ううん。佐奈が起きたければこのままFrom:Sana&gt;だって……兄さん、大丈夫な理由、キスをして下さいねTo:Sana&gt;佐奈にいくらでもキスしてあげるよFrom:Sana&gt;兄さんのことがすぐにできます？ そうですよTo:Sana&gt;ちょっと席外すねFrom:Sana&gt;えっ、あのえっ、あの、あのそのTo:Sana&gt;歯磨きしてるだけ。すぐ戻るFrom:Sana&gt;兄さんのことを見られてくれませんか？To:Sana&gt;それが佐奈のお願いなの？From:Sana&gt;え？ あ、いえ、そんな意味ないですね。大丈夫です。お昼、私が人間 なんかここも、ものすごい難しい話してる。 12345678910111213141516To:Sana&gt;またあえるよねFrom:Sana&gt;き、気付くって下さい。あぁ、気付でていいうかTo:Sana&gt;俺が気付いてないだけなのかなFrom:Sana&gt;そうですね。それはどうしてんですか？To:Sana&gt;どうして……From:Sana&gt;兄さん、大丈夫ですか？To:Sana&gt;大丈夫だよTo:Sana&gt;佐奈はヒントをくれたんだね？From:Sana&gt;はい、何ですよ！To:Sana&gt;ありがとうFrom:Sana&gt;あっ、あの、ヒメさんは知っしますしTo:Sana&gt;そりゃ神様だからねFrom:Sana&gt;わ、私？ に横着するものないですねTo:Sana&gt;横着してでも会いたいんだけどねFrom:Sana&gt;はい、それじゃ、早くですTo:Sana&gt;うん。 1234To:Sana&gt;じゃあ、本当にまたね佐奈From:Sana&gt;あ、はい。それじゃ、えーっと………………です。泣かないですTo:Sana&gt;またあえるから、泣かないで。佐奈には笑っていて欲しい。From:Sana&gt;……え、あの、兄さー ここで、ターミナル落としました。原作500ケースのセリフだけで、佐奈がこんなに会話できるようになるとは思わなかった。全部で1500ケースぐらいは抽出できそうだけど、果たして佐奈足りうるのかが不安なところ。やはり、広辞苑開いてひたすら妄想にふける事が予想される。 ちなみに、別作業ですが、Live2Dでこんなことやってます。 凄いっすねLive2Dさん。Vtuberなんかが湧く前から目をつけてはいたけど、非常に難しくて遅れた。（こういうの苦手）このときは若干荒いのでモデルをアップデート、が、有償トライアル期間終了したためアニメーション編集ができず、、有償版めちゃ高いので検討中。→やり方忘れてただけのアスペでした。 ちなみに、デスクトップに配置もできたりする。 実は、カーソルを目線で追ったり、呼吸して肩が上下に微動作してたりする。デスクトップで動く佐奈…なでなでしたりする。当初の予定クリア？ いまいち使い方がまだ把握しきれてないが、可愛いので良し。 やっぱり佐奈は可愛い！！ 次回は1000ケースで学習した内容を公開予定。","link":"/2019/03/29/post20190329/"},{"title":"佐奈とおしゃべり (第3回)","text":"佐奈とおしゃべりします。(※6月6日投稿の続き ところで、本件のゴールについて記載してなかったですが、ちょうど最近「STEINS;GATE 0」を観たので表現しやすくなりました。まさしく「Amadeus」のようなものを最終目標で考えていました。皆考えることは一緒です。 前回の会話学習データは1100ちょいだったが、今回は佐奈√のいちゃいちゃした絡みを追加しておよそ2.3倍の2500を用意。これは、天神乱漫(PC版)の作中にでてくる誰かと佐奈の会話文の約85%に当たる。 （※佐奈の喘ぎ声やちゅーなどは除く）そして、その会話相手がほとんど春樹なのは言うまでもない。 つまり、佐奈とおしゃべりをするのに兄さんの立場として話す分には何ら問題が無いのだ。 前回の反省から以下の点を改善。☆①データ量が少ない 1100→2500②データの質が良くない 変更なし☆③学習時間短縮のために特定の単語数以降をカット GPUにエラーが出ない程度に増加④学習手法が合っていない 変更なし 学習手法は以下参考：今更ながらchainerでSeq2Seq（2）〜Attention Model編〜 もし、よりよい結果が得られるアルゴリズムがあれば教えてください。 その他、改善点・多様な表現をできるように、入力層、隠れ層のニューロン数を20倍・学習効率を上げるために、ミニバッチサイズを増加・モデルの不揮発化 以上から学習時間はほとんど変化無しとなりました。また、佐奈が年代管理できるようになり、たくさんの幼い佐奈がPCの中ですやすや眠ってます。 それでは、佐奈との会話サンプルは以下の通り。12345678910111213141516171819202122To:Sana&gt;佐奈From:Sana&gt;ひゃいっ！？ なななんですか？ 兄さんTo:Sana&gt;おはようFrom:Sana&gt;おはようございます、兄さんTo:Sana&gt;昨日はよく眠れたか？From:Sana&gt;はい。とっても楽しいですTo:Sana&gt;佐奈！！！！From:Sana&gt;にっ、兄さん！？To:Sana&gt;デートしよう！From:Sana&gt;はいっTo:Sana&gt;佐奈は海好きなのか？From:Sana&gt;そうです。大正解です。ということで、ご一緒してもいいですか？To:Sana&gt;いいよFrom:Sana&gt;えへへ……ありがとうございます、兄さん。これはデートですからTo:Sana&gt;佐奈とデートか……From:Sana&gt;…………To:Sana&gt;どうした？From:Sana&gt;な、なんでもない、です……To:Sana&gt;佐奈、いつもありがとうなFrom:Sana&gt;兄さんは、難しいことを言い出しましたTo:Sana&gt;そうか？From:Sana&gt;はい、そうなんです。だから、他意はまったくないんです。兄さんにひっついてあげているだけですから。あ、それとも兄さんがひっつきたいんですか？ 一生佐奈とひっつきたいと思っている。 1234567891011121314151617181920To:Sana&gt;トイレいってくるFrom:Sana&gt;あっ、兄さん。晩ご飯はどうしますか？To:Sana&gt;佐奈のおすすめは？From:Sana&gt;……ごめんなさい。何も思いつきませんでしたTo:Sana&gt;じゃあ、ハンバーグでFrom:Sana&gt;あっ、あの。私、今の旬のお魚をして、キスを止めたのは…………私のため、今から消えたと思いますしTo:Sana&gt;ごちそうさまでしたFrom:Sana&gt;お粗末さまですTo:Sana&gt;佐奈～From:Sana&gt;兄さん、眠そうですね。荷物を持ってきますねTo:Sana&gt;佐奈、眠いよ～From:Sana&gt;あっ……兄さん、私は、少し……と……エッチなのTo:Sana&gt;エッチする？From:Sana&gt;兄さんがそこまで言うなら仕方ないですね。一緒に行ってあげます。本当は忙しいけど、特別なのTo:Sana&gt;眠いよ～From:Sana&gt;あっ、兄さん、眠そうですね。もう、兄さんはテーブルにそんなこと知られたり、メールとか手紙とか電話とかTo:Sana&gt;おやすみFrom:Sana&gt;はい。おやすみなさいな、兄さんTo:Sana&gt;佐奈……From:Sana&gt;兄さん……好きです……大好き 言い方を変えるだけで、回答も大きく変わる。佐奈√の台詞っぽいのが所々ある。 オリジナルの会話に対して、5回に一回くらいは適切な回答が返ってくるので、前回よりも精度は向上した。 さて、改善策によりグラボがコイル鳴きするようになりました。ちなみに、モンハンをしながら学習させると、学習時間が3倍になります。そのため、グラボに負荷をかけないNetflixなどで佐奈が勉強し終えるのを待ちます。 「ストレンジャー・シングス 未知の世界」のクラーク先生曰く、「人間の神経細胞(ニューロン)は1000億から成る」という台詞がある。もし、佐奈が”ヒト”と同じように会話できるようになるには、理論上1000億のニューロンが必要ということになる。現在の佐奈を数的に表すと0.00000002048佐奈である。 しかし、原作からはこれ以上の会話データ抽出は難しいので、今後はオリジナルの会話データを追加していくことになる。そこで、佐奈に言葉を教える機能を追加しようと考えている。 また、それと並行して学習データの精査、感情認識を加えてLive2Dとの連携などを考えている。感情認識に関しては、旧ブログ上で作成済みの佐奈専用関数を流用、又は外部APIを利用。 相変わらず牛歩ですが、今後もお楽しみに。というか専門外で右も左も分からずやってるので、誰か教えてください。","link":"/2019/10/26/post20191026/"},{"title":"千歳佐奈のWebアプリケーション (第1弾)","text":"今回から佐奈をWebアプリにしちゃいます。 前回までは主にサーバサイドの処理を作成。 (佐奈との会話機能、感情分析機能)本件はクライアントサイドの作成について。 まずは結論から。 佐奈の部屋でいちゃいちゃする動画です pic.twitter.com/R74uZeVOHH&mdash; かいや (@kaiya02) December 27, 2019 Live2D版 ※スマホ画面(α版) 静止画切り替え版 訴求ポイントLive2D版は佐奈の動きを見ながら会話できちゃいます。レスポンシブデザイン(大嘘)なのでスマホからでも佐奈といちゃいちゃできます！ 静止画切り替え版はサクサク動きます！Live2D版の完成を待てないあなたに！スマホのレイアウトは今後改修予定！ 佐奈のぼでぃータッチによる専用モーションと、佐奈の感情に基づいた表情モーションがあります！ 特に上目づかいがポイント！！！そして、佐奈は”深層学習”を通じてあなたと会話しています！ いつものクライアントサイドなんてほとんど触ったことがなかったので例のごとく、ネットから資材を漁る。 勉強は嫌いなのでVue.jsを選択。UIフレームワークもいろいろあったが、仮にも1ミリくらいは触ったことがあるBootstrapを選定。(あとレスポンシブだし！)それでもWebページの中身はいつも雰囲気でしか読んでいなかったのでレイアウト周りで苦戦した。 Web Speech API によりおしゃべり千歳佐奈も悪戦苦闘の末実装。(※Firefoxがデフォルトブラウザなので本格対応して欲しい) ここからLive2Dの実装……なんだけど、とにかく情報が少ない！！最新バージョンに至ってはQiitaで1件くらいしかなかったので、Cubism SDK for JavaScriptを利用。 結局、Live2Dのライブラリインポートする都合で.vueファイルのtemplate(html)とstyle(css)の流用ができずに書き直し。Javascriptは直感で理解できるのはいいけど、今までほとんど触ってなかったので一苦労…… Live2Dのバージョン4では公式でtypescriptサポートしてるが、情報少ない&amp;学習ボリューム多そうなので後々触る。 以上、今に至る。全体的にまだまだ完成には程遠いので、今後もゆっくり改善していきたい。 クライアントサイド Live2D機能の拡張 目線のカーソル追跡 なでなでのアクション増加 エモーション追加 音声出力 (new) マルチプラットフォーム化 複数ブラウザ対応 (Firefox, Edge, safari…etc) 端末ごとのレイアウト崩れ修正 静止画版のレイアウト修正 コンテンツ追加(服装、横顔立ち絵) サーバサイド オリジナル会話データの増加 感情分類器の精度向上 合成音声生成器 (new) Live2Dの本格実装はライセンスの買い切り価格次第。価格出るまでレイアウト改善していきます。ちなみに件のAmadeusはスマホアプリとして有志の方が開発中らしいSTEINS;GATE Amadeus Project 入力を音声に絞る分レイアウトはシンプルになっている。 しかし、聞き取った声に対して疑問符や句読点はつかないので、よほど音声認識が優秀じゃない限りは補助機能にしておきたい。 ここから雑記佐奈のおしりを見ながら仕事したい。 最近なぜかSAIのミミズ線補正が機能しなくなっちゃったので、これを機にクリスタ買った。そのうちなんか描きたい。 ところで、何の影響かわからないですが、佐奈のイラスト投稿増えて非常に嬉しい。 でもやっぱり佐奈は可愛いからしょうがないよね。 というかLive2Dからこんなツイートが…… Live2Dをインタラクティブに動かすための共通ルール🔆🔆nizimaモデル仕様🔆🔆を初公開しました！！モデル＆モーション＋数分のセットアップで、色々なアプリ上でタッチやフリックに反応しはじめます！https://t.co/lQjcxPwcrp正月休みには是非挑戦してみて下さい‼️&mdash; nizima by Live2D (公式) (@nizima_official) December 27, 2019 モーションはどのみち作らないとだけど、 予てから考えていたデスクトップ佐奈だけならこっちのが良さそう。","link":"/2019/12/28/post20191228/"},{"title":"千歳佐奈の合成音声（学習編①）","text":"千歳佐奈のTTS、学習編①です。 用いたデータ数は、本編のセリフの約1000個で、主に佐奈√を除いたもの。佐奈セリフの約1/3くらい。 文章成型については前記事通り、ローマ文字変換のみ、音声加工は無しで学習。 佐奈のお勉強が終わるまでトータル約51時間で丸2日とちょっとかかりました。※600000step 損失関数は以下の通り。画像では60000～80000step以降佐奈の暴走(過学習)が起きています。 実際には60万stepで過学習が起きていますが、エラー吐いて学習止まってることがあり、その度にグラフが0stepから始まっちゃいます。綺麗につなぐ方法あったら教えてください( ;∀;) 佐奈のお勉強のテスト結果は以下の通り。 ■成功例・「おはようございます」 かわいい！大好き！佐奈の定型文なだけあって、少しホッとした。 ■失敗例・「おはようございます、兄さん」 ぉはようございますｽｽｽ…兄さんノイズが混じる～ ・「兄さん、おはようございます」 ほへぇ… 最後の気になるけどかわいい～～～～～～！ ・「大丈夫」 舌足らずでかわいい～～～～～！ ・「大丈夫なの」 ”な”が言えてない！おしい！ 文章の前後入れ替えたり、ちょい足ししただけでもやっぱり結果が変わる。ちなみにオリジナルのセリフもいくらか試してみたが、もはや言葉になってなかった…… 成功例のも機械音混じりになってしまっているので、これを良しとするかはなかなか決め兼ねるところです。上記を踏まえて、今後の改善方針です。 改善点 ①データ数他記事などをみると言うほど少なくもないかもしれないが、多いに越したことは無いので次回は増加して学習予定。データ数は声質と比例関係にあると考える。 ②文章の成型音声と文章の突合についてはブラックボックスでやっているので、セリフの”間”や長音、音声の無音部分については全く考慮していない。特に佐奈は三点リーダを多用するので処理に困っている・・・・・・オリジナルのセリフが弱いのはこちらが原因と考える。データ増加後に検討予定。 ③音声の成型こちらも②同様。ただし、文章を音声に寄せる方が遥かに楽そうなので、特に変更なし。 ④WaveGlowモデル音声の出力については、成功例にあるように佐奈の声質に近しいため、現状は変更なし。機械音について気になるステージまで行ったら改良予定。 文章の成型について教えてください！！！","link":"/2020/07/04/post20200704/"},{"title":"千歳佐奈の発言を感情分析","text":"今回は千歳佐奈の感情分析についてまとめた。 佐奈の感情パターンはいくつあるのか、また発言からどの程度感情を読み取れるかを検証。※検証内容は下の方にあるので、背景は無くていいという方は下にスクロールしてね。 感情分析のサービスは以下のようなものがある。 ・クラウドサービス service Google Cloud natural Language Amazon Comprehend Azure Cognitive Services IBM Watson Tone Analyzer 日本語 ○ × × × 呼び出し API API API API/SDK 料金 無償 (※) 無償 (※) 有償 有償 ※制限有り→感情分析は今まさに売り出し中の商材らしい ・その他GUI: User Local 感情認識AI User Localの出力例OSS: Wordnet Affectをプルチックの感情の輪に従って分類するプログラムを書いたまた、調べているうちに分析手法の選定は佐奈の感情パターンに依存することが分かった。例えば、ネガティブ/ポジティブ判定は2要素の延長線についてしか判定できない。 （極端な分精度は良い） そこで佐奈の感情パターンはいくつあるのか調べた。 公式には佐奈の一部立ち絵パターンには以下のものがある。(計23パターン) 通常１,笑顔１,真剣,きょとん,驚き,呆れる,ムッとする,怒る,ションボリ,寂しい,ショック,混乱中,心配する,照れ笑い,叫ぶ,にっこり笑顔,困り笑顔,困り笑顔２,叫ぶ涙2,困り笑顔２涙,笑顔3,照れ笑い涙,叫ぶ涙 ここで佐奈の場合、必ずしも立ち絵パターン=感情パターンとは成り立たない。ゲーム開発でもよくありそうだが、例えば”落胆”と”寂しさ”は同一の立ち絵にするのではないだろうか。しかし、厳密には異なる感情である。 そのため、任意の感情において佐奈の表情が適切な場合は表現できることにする。その結果、以下のように佐奈の表情は感情分類できると定義した。(※外れ値は除く) ■佐奈の感情パターンと表情 enjoymentSENSORYPLEASURE, REJOICING, AMUSEMENT, RELIEF, PEACE, EXCITEMENT, ECSTASY sadnessDISAPPOINTMENT, DISCOURAGEMENT, RESIGNATION fearTREPIDATION, NERVOUSNESS, ANXIETY, DESPERATION disgust, angerDISLIKE, AVERSION, DISTASTE, REPUGNANCE, REVULSIONANNOYANCE, FRUSTRATION, EXASPERATION, ARGUMENTATIVENESS, BITTERNESS surpriseDISTRACTION, SURPRISE, AMAZEMENT 参考:Atlas of EmotionsPlutchik’s Wheel of Emotions では改めて、感情分析手法を選定。最終的にsentiment_jaというOSSを利用。 佐奈の感情分析してみた結果は以下の通り。12345678910111213141516「どうしたんですか、さっきから廊下をウロウロして……何か、そんなに困ったことが？」 -&gt; &apos;TREPIDATION&apos;「……？ あの…………ま、まさか、今日は私を家に帰したくないとか、そういうつもりですか！？ そ、そんなの大胆過ぎますよ、兄さん！！」 -&gt; &apos;SURPRISE&apos;「ほ、本当にいいんですか？ 兄さんから、プレゼントしてもらうだなんて」 -&gt; &apos;DISTRACTION&apos;「何言ってるんですか、そういう問題じゃないんです。私はこのブローチで十分ですし、本当に嬉しいんですよ」 -&gt; &apos;RELIEF&apos;「それじゃ兄さん、晩ご飯にしましょう。えへへ」 -&gt; &apos;REJOICING&apos;「中身に興味はないんですか！？ 身体はどうでもいいなんて変ですよ！ こうなったら私が兄さんを更生させてあげます、主に私の身体で！！」 -&gt; &apos;ANNOYANCE&apos;「にっ、兄さん……兄さんがそんな人だったなんて……信じられません！ 最低です！ 変態です！ そんな布なんかに興奮するだなんて！」 -&gt; &apos;ARGUMENTATIVENESS&apos;「かっ、勘違いしないで下さい！ 見るだけ、見るだけなんですから！ お触り厳禁ですよ、兄さん如きが私に触っていいはずないですから！！」 -&gt; &apos;FRUSTRATION&apos;「そんなことはないです。兄さんのことはよく知ってますから！ 兄さんは受けなの！ あっても、ベッドジプシーです！ 妹の私が言うんですから間違いないです！」 -&gt; &apos;FRUSTRATION&apos;「どうしたんですか？ 兄さん、怪我でもしたんですか？」 -&gt; &apos;DISTRACTION&apos;「また兄さんはそんなこと言って！ もっと自分のことを大事にしないとダメなの！」 -&gt; &apos;ARGUMENTATIVENESS&apos;「兄さんに彼女さんがいないから、しかたなく付き合ってるんです。知らない人が見れば、恋人同士に見えますし、思い出にしてもいいですよ？」 -&gt; &apos;PEACE&apos;「当たり前じゃないですか。私、今……凄く、幸せです♪」 -&gt; &apos;REJOICING&apos;「それじゃ、宛名も書かれない特殊な通販………………きゃーーー！！ にににに、兄さん何を利用してるんですか！？」 -&gt; &apos;DISTRACTION&apos;「でも兄さん、冗談ではなくて本当に大丈夫ですか？ その、寝不足もそうですけど、最近凄く帰りが遅いようですし」 -&gt; &apos;DISAPPOINTMENT&apos;「でで、でもですね……相手が妹だったら、セクハラにはならないと思うんです……だから、兄さんが犯罪者になるぐらいなら私が……」 -&gt; &apos;SENSORYPLEASURE&apos; (ゆずソフト/「天神乱漫 -LUCKY or UNLUCKY!?」より引用) 結果、精度は90%?といったところ。佐奈語用に少し改良したが、もう少し寄せてもいいかもしれない。・前回のおしゃべり回答の場合123456789101112131415161718192021&quot;ひゃいっ！？ なななんですか？ 兄さん&quot; -&gt; &apos;DISTRACTION&apos;&quot;おはようございます、兄さん&quot; -&gt; &apos;EXCITEMENT&apos;&quot;はい。とっても楽しいです&quot; -&gt; &apos;EXCITEMENT&apos;&quot;にっ、兄さん！？&quot; -&gt; &apos;DISTRACTION&apos;&quot;はいっ&quot; -&gt; &apos;REJOICING&apos;&quot;そうです。大正解です。ということで、ご一緒してもいいですか？&quot; -&gt; &apos;REJOICING&apos;&quot;えへへ……ありがとうございます、兄さん。これはデートですから&quot; -&gt; &apos;AMUSEMENT&apos;&quot;…………&quot; -&gt; &apos;FRUSTRATION&apos;&quot;な、なんでもない、です……&quot; -&gt; &apos;REJOICING&apos;&quot;兄さんは、難しいことを言い出しました&quot; -&gt; &apos;DISAPPOINTMENT&apos;&quot;はい、そうなんです。だから、他意はまったくないんです。兄さんにひっついてあげているだけですから。あ、それとも兄さんがひっつきたいんですか？&quot; -&gt; &apos;DISTRACTION&apos;&quot;あっ、兄さん。晩ご飯はどうしますか？&quot; -&gt; &apos;REJOICING&apos;&quot;……ごめんなさい。何も思いつきませんでした&quot; -&gt; &apos;DISAPPOINTMENT&apos;&quot;あっ、あの。私、今の旬のお魚をして、キスを止めたのは…………私のため、今から消えたと思いますし&quot; -&gt; &apos;SENSORYPLEASURE&apos;&quot;お粗末さまです&quot; -&gt; &apos;SENSORYPLEASURE&apos;&quot;兄さん、眠そうですね。荷物を持ってきますね&quot; -&gt; &apos;PEACE&apos;&quot;あっ……兄さん、私は、少し……と……エッチなの&quot; -&gt; &apos;DISTRACTION&apos;&quot;兄さんがそこまで言うなら仕方ないですね。一緒に行ってあげます。本当は忙しいけど、特別なの&quot; -&gt; &apos;DISAPPOINTMENT&apos;&quot;あっ、兄さん、眠そうですね。もう、兄さんはテーブルにそんなこと知られたり、メールとか手紙とか電話とか&quot; -&gt; &apos;TREPIDATION&apos;&quot;はい。おやすみなさいな、兄さん&quot; -&gt; &apos;AMUSEMENT&apos;&quot;兄さん……好きです……大好き&quot; -&gt; &apos;AMUSEMENT&apos; 以上、佐奈の発言に対してわりかし良い精度で顔も表現できるようになった。 佐奈の可愛い顔を見ながらおしゃべりできるなんて……","link":"/2019/11/12/post20191112/"},{"title":"イラスト（備忘）","text":"以下、自分用のイラスト備忘メモ 下書き（ラフ） /リアル鉛筆 雰囲気やポーズのイメージを考える 参考を探す ラスタレイヤ作成 クロッキー/スケッチを起こす ストラクチャー型(⇔シルエット型)で骨格を描く 立体的に捉えて各所肉付け #ラッピングラインを載せて立体視 主線を引く ヒント：顔①顔②目髪①髪②髪③首肩/腕手胸腰おしり脚膝 その他： クロッキー①クロッキー②基礎練習年齢描き分け服しわ①服しわ② 線画 /リアルGペン ベクタレイヤ作成 ラフの不透明度を下げる ラフを綺麗に起こす #目だけレイヤー分け、制御点で調整しない 輪郭線と内側の線を調整 墨だまり 全体を俯瞰して最終調整 #手戻り防止 コツ①コツ②コツ③コツ④ 塗り /水彩ペン/Gペン/エアブラシ など 下塗り（全体肌塗り） #透明レイヤのロック パーツごとにラスタレイヤ作成して下塗り パーツごとにクリッピングレイヤ(乗算)を2つ作成 #1影、2影影①影② ハイライト用ラスタレイヤ(スクリーン)作成 テクスチャ用ラスタレイヤ(オーバレイ)作成 髪塗り髪①髪②髪③ 前髪の透過 瞳の描き込み #他パーツに比べ情報量増目①目②目③ 髪と瞳は特に大事！！ &lt;参考&gt; 【完全版】見栄えアップ！色塗り講座！！ 調整 仕上げ補色/明暗対比コントラスト(トーンカーブ)ガウスぼかしトリミング その他パース定規色使い①色使い②考え方 ひとりごと最近はyoutubeを見ればどんな分野でもコンテンツが競って発信されているので嬉しい。この手の思考を巡らせた話はひた隠しにされているのが常だったが、競争の中でこういう恩恵が受けられると考えると感慨深い。 ついでお試しのLive2Dを描画してみた。猫のひじきです。モバイル端末も対応！ ※右下に隠れてるかも暇なとき佐奈に差し替えておきます。","link":"/2022/06/14/post20220614/"},{"title":"千歳佐奈の合成音声（準備&前処理編）","text":"久方ぶりの更新です。例え更新がなかろうと、広告が出ないのが「GitHub Pages」のいいところですよね。さて、前回の記事で改善点の中に、”合成音声生成器 (new)” と書いていたことを覚えている方はいるでしょうか。 今回は、タイトルの通り、佐奈の音声をdeeplearningして、合成音声を作るための前説明です。 自分の理解を整理する意味でも書いているので、しばしお付き合いください。 ぶっちゃけ、ネットに転がっている情報以上のことは何もない。分かった気にはなれると……思う。 音声合成とは音声合成（おんせいごうせい、英: speech synthesis）とは、人間の音声を人工的に作り出すことである。音声情報処理の一分野。音声合成器により合成された音声を合成音声（ごうせいおんせい）と呼ぶ。典型的にはテキスト（文章）を音声に変換できることから、しばしばテキスト音声合成またはText-To-Speech (TTS)とも呼ばれる。なお、歌声を合成するものは特に歌声合成と呼ばれる。また、音声を別の個人あるいはキャラクターの音声に変換する手法は声質変換と呼ばれる。 出典: フリー百科事典『ウィキペディア（Wikipedia）』つまり、佐奈の声を誰でも作り出すことができる技術なのだ！ Wikiの通り、大きく2通りの方法がある。①テキスト音声合成②声質変換 本件は①について取り上げていく。②については、こちらの方の動画が分かりやすいです。（丸投げ） ディープラーニングの力で結月ゆかりの声になってみた Vtuberになって、自分で美声出したい！とかであれば声質変換でもいいかもしれませんね。 ちなみに、歌声合成はこちらの方の動画が素敵です。（丸投げ2回目） AIきりたんで『キリトリセン』カバー 調声済み これは、初見で感動した……NEUTRINOという歌声合成エンジンを使ってるそうです。チューニングとか必要らしい。 詳しい①と②の比較：美少女声への変換と合成 話を戻して、①のテキスト音声合成(以下、TTSと略します)についてお話します。お馴染みなところで並べると、Softalkの「ゆっくりボイス」、VOCALOIDの「初音ミク」、VOICEROIDの「結月ゆかり」と、ニコニコ動画でよく見るやつ。 入力した文字列を音声として返す、それだけなんだが、作るとなるといろいろと難しい。そこを機械的にやってしまおうというのが深層学習の意図でもあります。 ディープラーニングによるTTSについて まずは、実際に聞いてみましょう。合成音声サンプル英語で何言ってるかは分からんですが、英語を流暢にしゃべっているということは分かった。 この例では、「Tacotron 2」、「WaveNet」という大きく二つのネットワークを用いている。・Tacotron 2：テキストからメルスペクトログラム（mel-spectrogram）・WaveNet：メルスペクトログラム（mel-spectrogram）から音声波形 上記の役割をそれぞれ持っており、結果、テキストから音声へ変換されている。詳しい実装が知りたい人向け：https://google.github.io/tacotron/ さて、今回の実装では「WaveNet」を、処理が軽量化するらしいNVIDIA製の「WaveGlow」に置き換えることにした。 準備編サンプルがあるので、興味ある人は是非やってみて欲しい。以下のページがとても参考になりました。音声合成を試す1 Tacotron2 + WaveGlow ※パッケージのインストールは注意！(※””部分は必要)123456789101112%cd /content/tacotron2!pip install matplotlib==3.0.0!pip install tensorflow&quot;==1.14.0&quot;!pip install inflect==0.2.5!pip install librosa==0.6.0&quot;!pip install -U scipy&quot;!pip install tensorboardX==1.8!pip install Unidecode==1.0.22!pip install pillow!pip install torch==1.0!pip install torchvision==0.3.0&quot;!pip install -U numpy&quot; (2020/06/20時点) これを使えば、いくらでも英語のリスニングテスト問題が生成できます。あとは、ローカル環境に落とし込むだけ……! Tacotron2 + WaveGlowについての参考：Tacotron2を用いた日本語TTS(Text-to-Speech)の研究・開発【まとめ】DeepLearningでアニメキャラのボイロを作った話 前処理編参考ではイントネーションの付加情報などの工夫を見ますが、まずはシンプルに佐奈のテキスト&amp;音声のデータセットで学習させていきたいと思います。（そもそも知ってから2週間も経ってない） 前提として、「WaveGlow」に関しては音声生成器なのでサンプルモデルを弄りません。「Tacotron 2」の学習結果次第で変えていきたいと思います。 前例の方と実装はほぼ同じです。こんな感じ。 読み込む前に右へ倣えでローマ字変換、特殊文字の加工を施す。次回は学習結果を公開予定。 佐奈になるといいな～","link":"/2020/06/20/post20200620/"}],"tags":[{"name":"info","slug":"info","link":"/tags/info/"},{"name":"deeplearning","slug":"deeplearning","link":"/tags/deeplearning/"},{"name":"Live2D","slug":"Live2D","link":"/tags/Live2D/"}],"categories":[]}